src/cf/AccumulationRegisters/СвободныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>СвободныеОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОчередьRMQ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Маршрутизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/СвободныеОстатки/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Отказ Тогда
		Возврат 
	КонецЕсли; 
	ДополнительныеСвойства.Вставить("ИзмененныеОстаткиНоменклатуры",Новый Массив);
	Для каждого Стр из ЭтотОбъект Цикл
		ДополнительныеСвойства.ИзмененныеОстаткиНоменклатуры.Добавить(Стр.Номенклатура);		
	КонецЦикла;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Отказ Тогда
		Возврат 
	КонецЕсли;
	
	Для каждого Стр из ЭтотОбъект Цикл
		ДополнительныеСвойства.ИзмененныеОстаткиНоменклатуры.Добавить(Стр.Номенклатура);		
	КонецЦикла;
	
	//Rabbit MQ
	Маршрутизация = "CRM_remaining";
	
	//Отправляться будут только номенклатуры с Кодом CRM
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.КодCRM КАК КодCRM
		|ПОМЕСТИТЬ ВтНоменклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылки)
		|	И Номенклатура.КодCRM <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтНоменклатура.КодCRM КАК КодCRM,
		|	ЕСТЬNULL(СвободныеОстаткиОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток
		|ИЗ
		|	ВтНоменклатура КАК ВтНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(
		|				,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ВтНоменклатура.Ссылка КАК Ссылка
		|					ИЗ
		|						ВтНоменклатура КАК ВтНоменклатура)) КАК СвободныеОстаткиОстатки
		|		ПО ВтНоменклатура.Ссылка = СвободныеОстаткиОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылки", ДополнительныеСвойства.ИзмененныеОстаткиНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	НЗОчередьRMQ = РегистрыСведений.ОчередьRMQ.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		//Запись сообщения в очередь
		
		Данные = Новый Структура;  
	    Данные.Вставить("КодCRM", Выборка.КодCRM); 
		Данные.Вставить("СвободныйОстаток", Выборка.СвободныйОстаток);
		ЗаписьJSON = Новый ЗаписьJSON; 
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON,Данные);  
	    Сообщение = ЗаписьJSON.Закрыть();
		
		СтрНЗ = НЗОчередьRMQ.Добавить();
		СтрНЗ.ID = новый УникальныйИдентификатор;
		СтрНЗ.Сообщение = Сообщение;
		СтрНЗ.Маршрутизация = Маршрутизация;
		СтрНЗ.Записать();
	КонецЦикла;	
	 
	
КонецПроцедуры
